---
kind: property
id: P:Autodesk.Revit.DB.Events.FileImportedEventArgs.Path
source: html/574df4ca-91c5-dad7-8b77-976d2f64ab1f.htm
---
# Autodesk.Revit.DB.Events.FileImportedEventArgs.Path Property

Path of the source file that was imported.

## Syntax (C#)
```csharp
public string Path { get; }
```